import networkx as nx
import matplotlib.pyplot as plt

G = nx.Graph()

G.add_nodes_from(['Еспресо', 'Молоко',  'Морозиво', 'Гаряча вода', 'Американо', 'Латe', 'Aфогато', 'Капучіно'])
edges = [
    ("Еспресо", "Капучіно", {"вміст":"30"}),
    ("Еспресо", "Aфогато", {"вміст":"60"}),
    ("Еспресо", "Американо", {"вміст":"60"}),
    ("Еспресо", "Латe", {"вміст":"60"}),
    ("Молоко", "Aфогато", {"вміст":"120"}),
    ("Молоко", "Латe", {"вміст":"360"}),
    ("Молоко", "Капучіно", {"вміст":"180"}),
    ("Морозиво", "Aфогато", {"вміст":"60"}),
    ("Гаряча вода", "Американо", {"вміст":"200"})
    ]
G.add_weighted_edges_from(edges)

# Застосування алгоритму Дейкстри
shortest_paths = nx.single_source_dijkstra_path(G, source = "Еспресо", weight='вміст')
shortest_path_lengths = nx.single_source_dijkstra_path_length(G, source = "Еспресо", weight='вміст')

print(shortest_paths)  # виведе найкоротші шляхи від вузла 'Еспресо' до всіх інших вузлів
print(shortest_path_lengths)  # виведе довжини найкоротших шляхів від вузла 'Еспресо' до всіх інших вузлів
